# -*- coding: utf-8 -*-

DRIVING_CONTROL_STYLE = [
    "谨慎驾驶", "平稳驾驶", "激进驾驶", "反应迟缓", 
    "反应迅速", "动态操控", "冒险驾驶", "粗心马虎驾驶"
]

VISUAL_ATTENTION_STYLE = [
    "专注前方", "忽视前方", "观察四周", "忽视四周", "关注行人", 
    "忽视行人", "关注旁车", "忽视旁车", "查看后视", "忽视后视", 
    "注视狭窄", "适度扫视", "频繁转移", "观察仪表", "忽略仪表", 
    "观察系统提示", "忽略系统提示"
]

INTEGRATED_STYLE = [
    "谨慎", "稳定", "激进", "粗心", "分心", "专注"
]

SUGGESTION = [
    "减速", "适当加速", "变道", "超车", "观察行人", "检查后视镜", "增加车距", "使用转向灯", "关注周围交通", 
    "手动驾驶", "自动驾驶", "继续保持", "准备接管", "观察信号灯", "观察系统提示"
]